from math import gcd

n = int(input())

## Напишите программу, которая находит наибольшую правильную несократимую дробь с суммой числителя и знаменателя
## равной n.

nod = gcd(4, 10)
print(nod)

